import {
    NOTIFICATION_SPINNER_ACTIVATE,
    NOTIFICATION_SPINNER_DEACTIVATE,
    SET_NOTIFICATION_DATA
} from "../types/notificationTypes";

let initial_state = {
    notices:[
        {title: '1-сентябрь', text:'Кыргыз мамлекеттик медициналык академиясынын Профсоюздук кеңешинин отчёттук чогулушу 2011-жылдын 13-майында саат 16:00дө өткөрүлөт. Чогулушка бардык факультеттин окутуучулары жана кызматкерлери катышуусу керек. Күн тартиби: 1. 2010-2011-окуу жылынын жыйынтыгы боюнча окуу жайдын Профсоюздук кеңештин төрагасынын отчётун угуу. 2. Жай мезгилиндеги өргүү убагы үчүн эс алуу жайларына жолдомолорду бөлүштүрүү жөнүндө Профсоюздук кеңешинин мүчөсү А.', date: '01.01.2012', author:'А. Асанов', type:''},
        {title: '23-Сентябрь', text:'Кыргыз мамлекеттик медициналык академиясынын Профсоюздук кеңешинин отчёттук чогулушу 2011-жылдын 13-майында саат 16:00дө өткөрүлөт. Чогулушка бардык факультеттин окутуучулары жана кызматкерлери катышуусу керек. Күн тартиби: 1. 2010-2011-окуу жылынын жыйынтыгы боюнча окуу жайдын Профсоюздук кеңештин төрагасынын отчётун угуу. 2. Жай мезгилиндеги өргүү убагы үчүн эс алуу жайларына жолдомолорду бөлүштүрүү жөнүндө Профсоюздук кеңешинин мүчөсү А.', date: '2.01.2008', author:'А. Асанов', type:''},
        {title: 'Мугалидер жумасы', text:'Кыргыз мамлекеттик медициналык академиясынын Профсоюздук кеңешинин отчёттук чогулушу 2011-жылдын 13-майында саат 16:00дө өткөрүлөт. Чогулушка бардык факультеттин окутуучулары жана кызматкерлери катышуусу керек. Күн тартиби: 1. 2010-2011-окуу жылынын жыйынтыгы боюнча окуу жайдын Профсоюздук кеңештин төрагасынын отчётун угуу. 2. Жай мезгилиндеги өргүү убагы үчүн эс алуу жайларына жолдомолорду бөлүштүрүү жөнүндө Профсоюздук кеңешинин мүчөсү А.', date: '08.11.2020', author:'А. Асанов', type:''}
    ],
    notice_spinner: false
}

function notificationPageReducer(state=initial_state, action){
    switch (action.type){
        case SET_NOTIFICATION_DATA:
            return {...state, notices: action.payload};
        case NOTIFICATION_SPINNER_ACTIVATE:
            return {...state, notice_spinner: true};
        case NOTIFICATION_SPINNER_DEACTIVATE:
            return {...state, notice_spinner: false};
        default:
            return state;
    }
}

export default notificationPageReducer;