const initial_state = {
    text:"Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Кылмыш-жаза кодексинин Уставына ылайык, Якира Е.Б. Даярдоо топторуна " +
        "студенттерди кабыл алуу (0 билим деңгээли) төмөнкүдөй тартипте жүргүзүлөт:" +
        " Бала бакчанын мектепке чейинки даярдоо топторуна (0-деңгээл) аңгемелешүү " +
        "түрүндө тандоодон өткөн 5-6 жаштагы балдар кабыл алынат (КР № 61 Якира Э.Б. " +
        "Кылмыш-жаза кодексинин 5.2. пунктун караңыз. 1). Май айында алдын ала электрондук" +
        " каттоодон өткөн балдар ата-энелери менен бирге маектешүүгө уруксат берилет. Маектешүү" +
        " мектепке чейинки топтордогу балдардын окууга даярдыгынын психологиялык " +
        "көрсөткүчтөрүн, жаңы материалды жана маалыматты кабыл алуу жөндөмдүүлүгүн, " +
        "кептин өнүгүшүн, курчап турган дүйнө жана адамдардын жашоосу жөнүндөгү идеяларын " +
        "аныктоого багытталган. Билим берүүнүн 0 деңгээлине балдарды кабыл алуу алынган жалпы " +
        "баллдын негизинде жүргүзүлөт бала интервьюнун жыйынтыгы боюнча жана текшерилүүчү он көрсөткүч " +
        "боюнча топтолгон упайлардын суммасы катары аныкталат. Өтүү баллы бош орундардын санына жараша" +
        " аңгемелешүүнүн аягында кабыл алуу комиссиясы тарабынан аныкталат жана аңгемелешүүнүн жыйынтыгы" +
        " менен бирге ата-энелерге жарыяланат. Башталгыч мектепке кабыл алуу №61 АФМСКнын Кылмыш-жаза " +
        "кодексинин Уставына ылайык, №61 МККнын балдар бакчасынын тарбиялануучулары 1-класска (I этап) " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "Мектепке чейинки балдар бакчасынын топторуна кабыл алуу No61 АФМСЛ " +
        "гана кабыл алынат (КР Кылмыш-жаза кодексинин уставын караңыз)"
}

function schoolAdmissionPageReducer(state=initial_state, action){
    switch (action.type){

        default:
            return state;
    }
}

export default schoolAdmissionPageReducer;